{
  "brush hair": "A person is detangling and smoothing their hair using a brush or comb.",
  "cartwheel": "A person is performing a gymnastic move where they rotate their body in a sideways circular motion, keeping their hands and feet on the ground.",
  "catch": "A person is grabbing or seizing something that has been thrown, dropped, or is in motion.",
  "chew": "A person is crushing food in their mouth using their teeth to break it down for digestion.",
  "clap": "A person is striking their hands together to make a sound, often to show appreciation or enjoyment.",
  "climb": "A person is ascending or moving up, often using both hands and feet, on a steep or vertical object.",
  "climb stairs": "A person is moving upward by stepping on a series of steps.",
  "dive": "A person is jumping or falling into water, head first, often from a platform or springboard.",
  "draw sword": "A person is pulling out a sword from its sheath, typically in preparation for a fight or battle.",
  "dribble": "In the context of sports like basketball or soccer, a person is controlling and moving the ball forward by tapping or kicking it.",
  "drink": "A person is consuming a liquid by swallowing it through the mouth.",
  "eat": "A person is consuming food by placing it in the mouth, chewing it, and swallowing it.",
  "fall floor": "A person is losing their balance or footing and coming down onto the ground.",
  "fencing": "A person is engaging in a sport where two competitors fight using 'rapier-style' swords, winning points by making contact with their opponent.",
  "flic flac": "In gymnastics, a person is performing a move that involves a backward roll into a handstand followed by a forward roll into a standing position.",
  "golf": "A person is playing a sport where they use clubs to hit balls into a series of holes on a course in as few strokes as possible.",
  "handstand": "A person is balancing their body upside down, supporting themselves with their hands.",
  "hit": "A person is striking someone or something with a blow or impact.",
  "hug": "A person is holding someone closely in their arms, typically as a sign of affection.",
  "jump": "A person is propelling themselves off the ground, typically into the air, by using their muscles in a quick, powerful movement.",
  "kick": "A person is striking or propelling in a specified direction with their foot.",
  "kick ball": "In the context of sports, a person is striking a ball with their foot to move it in a desired direction.",
  "kiss": "A person is touching or pressing their lips against another person's body in a gesture of affection, greeting, respect, or amorousness.",
  "laugh": "A person is making a spontaneous sounds and movements of the face and body that are the instinctive expressions of lively amusement and sometimes also of derision.",
  "pick": "A person is choosing or selecting an item or a person from a group.",
  "pour": "A person is transferring a liquid from one container to another.",
  "pullup": "A person is performing an upper body exercise where they lift their body up by pulling themselves up while hanging from a bar.",
  "punch": "A person is striking with the fist, typically as a form of attack or defense.",
  "push": "A person is applying force to an object in order to move it away from them.",
  "pushup": "A person is performing a conditioning exercise where they raise and lower their body using their arms while facing down.",
  "ride bike": "A person is operating and controlling a bicycle, typically by pedaling, to move from one place to another.",
  "ride horse": "A person is sitting on a horse's back and controlling its movements.",
  "run": "A person is moving at a speed faster than a walk, never having both or all the feet on the ground at the same time.",
  "shake hands": "Two people are grasping each other's right hands and moving them up and down, typically in greeting or agreement.",
  "shoot ball": "In the context of sports, a person is propelling a ball towards a target, often with the aim of scoring points.",
  "shoot bow": "A person is propelling an arrow from a bow towards a target.",
  "shoot gun": "A person is discharging a firearm, typically to hit, wound, or kill a target or animal.",
  "sit": "A person is adopting a position in which one's weight is supported by one's buttocks rather than one's feet and one's back is upright.",
  "situp": "A person is performing an exercise in which they lie flat on their back and then sit up without using their arms.",
  "smile": "A person is forming one's features into a pleased, kind, or amused expression, typically with the corners of the mouth turned up and the front teeth exposed.",
  "smoke": "A person is inhaling and exhaling the smoke produced by burning a substance, typically tobacco, in a cigarette, pipe, or cigar.",
  "somersault": "A person is performing an acrobatic exercise in which they roll forward or backward in a complete revolution, keeping their body taut and legs straight.",
  "stand": "A person is being in an upright position on their feet.",
  "swing baseball": "A person is moving a baseball bat in a sweeping motion to hit a pitched ball in the sport of baseball.",
  "sword": "A person is wielding a sword, typically involving movements like swinging or thrusting.",
  "sword exercise": "A person is performing a series of movements with a sword for training or physical fitness.",
  "talk": "A person is expressing thoughts, feelings, or ideas verbally to someone else.",
  "throw": "A person is propelling something through the air by a rapid movement of the arm and hand.",
  "turn": "A person is moving in a circular direction around an axis or point.",
  "walk": "A person is moving along by putting one foot in front of the other, allowing each foot to touch the ground before lifting the next.",
  "wave": "A person is moving their hand to and fro in greeting or as a signal."
}
