{
  "brush hair": "Prepare your hair: Ensure your hair is dry or slightly damp. If wet, use a wide-toothed comb to gently detangle before brushing.\n\nStart at the ends: Begin brushing from the ends of your hair, gradually working your way up towards the roots. Use gentle, downward strokes to prevent tangles and minimize breakage.\n\nBrush evenly: Brush all sections of your hair, including the sides and back, to distribute the brushing evenly and maintain a neat appearance.",
  "cartwheel": "Step forward with your dominant foot (the foot you feel most comfortable leading with) and simultaneously lift your arms up and out to the sides.\n\nAs you step forward, place your dominant hand on the ground, slightly forward and to the side of your body. Kick your non-dominant leg up and over your head, following it with your dominant leg. Your body will invert as your legs go over, and your hands will support your weight on the ground.\n\nPush off with your hands and bring your legs down to land on the ground. Complete the cartwheel by standing up straight and returning your arms to your sides.",
  "catch": "Tracking: Begin by visually tracking the object you intend to catch. Keep your eyes focused on the object's trajectory and anticipate its arrival point.\n\nPositioning: As the object approaches, position yourself by moving your body and adjusting your arms to be in the optimal catching position. This typically involves extending your arms toward the object while keeping your hands open and fingers ready to secure the catch.\n\nReceiving: As the object reaches you, time your movement to meet the object's path. Use your hands and fingers to securely grip or cradle the object, depending on its size and shape. Absorb the impact of the catch by allowing your arms and body to give slightly, ensuring a secure grip.",
  "chew": "Food Preparation: Begin by taking a bite or placing a piece of food in your mouth. Ensure that the food is adequately sized and positioned between your teeth for chewing.\n\nJaw Movement: Engage your jaw muscles to move your lower jaw up and down in a rhythmic motion. As you chew, your teeth come together to break down the food into smaller, more manageable pieces. This action helps to mechanically break down the food and mix it with saliva.\n\nSwallowing: Once the food has been sufficiently chewed and broken down, prepare to swallow. The tongue helps push the chewed food to the back of your mouth, initiating the swallowing reflex. The food then travels down the throat and into the esophagus, eventually making its way to the stomach for digestion.",
  "clap": "Hand Preparation: Start by extending both of your hands in front of you, with your palms facing each other and fingers spread open.\n\nHand Collision: Bring your hands together forcefully, making sure that your palms meet and your fingers make contact. The impact creates a sound known as a clap.\n\nHand Separation: After the hand collision, quickly separate your hands by pulling them apart. This motion creates a brief pause between claps and allows for the sound to resonate.",
  "climb": "Hand and Foot Placement: Begin by identifying suitable handholds and footholds on the climbing surface. Reach up with one hand and grasp a handhold, while simultaneously stepping up with one foot onto a foothold. Repeat this process, alternating hands and feet, to steadily ascend the climbing surface.\n\nWeight Transfer: As you secure your grip on a handhold and establish a foothold, transfer your body weight onto the engaged hand and foot. This helps maintain stability and balance while allowing you to free up the other hand and foot for the next movement.\n\nRepeating the Process: Continue the sequence of hand and foot placements, along with weight transfers, to progress upward. As you climb, assess the climbing route and adjust your movements accordingly, adapting to the available holds and maintaining a steady pace.",
  "climb stairs": "Approach: As you approach a set of stairs, position yourself at the base of the staircase facing the steps. Ensure you have a clear path and maintain a comfortable distance from the first step.\n\nStep Placement: Lift one leg and place your foot on the first step, ensuring that your entire foot is securely on the step's surface. Apply pressure to your foot to support your weight as you transfer it from the stationary leg to the stepping leg. Repeat this process, alternating legs, as you ascend the staircase.\n\nRhythm and Balance: As you climb, establish a comfortable rhythm by coordinating the movements of your legs and maintaining a consistent pace. Keep your body balanced by engaging your core muscles and maintaining an upright posture. Use the handrail if available for additional support and stability.",
  "dive": "Approach: Position yourself near the edge of the diving platform or the designated diving area, ensuring that it is safe and appropriate for diving. Stand with your feet shoulder-width apart and your arms relaxed by your sides.\n\nTakeoff: Bend your knees, preparing to generate upward momentum. As you push off from the diving platform or jump into the air, extend your arms forward and upward, reaching towards the intended entry point. Lean your body slightly forward to initiate the dive.\n\nEntry: Extend your body into a streamlined position as you descend towards the water. Keep your arms extended in front of you and bring your legs together, pointing your toes. Aim to enter the water smoothly and vertically, leading with your hands and head, minimizing any splash or disturbance. Allow your body to penetrate the water's surface and maintain a streamlined position until you resurface.",
  "draw sword": "Grip and Stance: Begin by assuming a proper stance with your feet shoulder-width apart, knees slightly bent, and body balanced. Place your non-dominant hand on the scabbard (the sheath of the sword) near the opening, while your dominant hand rests on the hilt of the sword. Ensure a firm grip on the hilt with your dominant hand.\n\nUnsheathe the Sword: With a controlled and fluid motion, use your non-dominant hand to grip the scabbard firmly while applying a gentle upward pressure. Simultaneously, use your dominant hand to draw the sword by sliding it out of the scabbard. Maintain control and ensure a smooth, uninterrupted motion as the sword clears the scabbard.\n\nAssume Ready Position: Once the sword is fully drawn, bring it to a ready position. Extend your dominant arm forward, positioning the sword blade in front of you and parallel to the ground. Maintain a strong grip on the hilt with your dominant hand while keeping your non-dominant hand clear of the blade. Your body should be prepared for further sword techniques or defensive maneuvers.",
  "dribble": "Ball Control: Begin by positioning yourself with the ball at your feet. Use the inside or outside of your foot to make contact with the ball, depending on the direction you want to dribble. Keep your head up and maintain awareness of your surroundings.\n\nBall Manipulation: With a combination of small touches and gentle taps, use your feet to keep the ball in close proximity as you move forward. Alternate between your left and right foot to maintain control while using your peripheral vision to assess the field or court.\n\nChange of Direction: To change direction while dribbling, perform a quick shift in body weight and direction. Use a combination of footwork, body feints, or changes in pace to deceive defenders and create openings for yourself or your teammates.",
  "drink": "Grab the Container: Begin by reaching for the container holding the drink. This could be a glass, cup, bottle, or any other vessel. Ensure that your hand has a firm grip on the container to prevent any accidental spills.\n\nLift and Tilt: Once you have a secure hold on the container, lift it towards your mouth. Tilt the container, allowing the liquid to flow into your mouth. Adjust the angle of the container to control the flow of the drink according to your preference.\n\nSwallow: As the liquid enters your mouth, swallow it by engaging the muscles in your throat. Allow the liquid to move from your mouth down your esophagus and into your stomach. Take your time and drink at a comfortable pace, avoiding gulping or drinking too quickly.",
  "eat": "Prepare and Bring Food to Mouth: Begin by selecting a bite-sized portion of food using utensils, such as a fork or spoon, or by using your hands. Lift the food towards your mouth, ensuring it is at a comfortable distance for eating.\n\nChew and Swallow: Once the food is in your mouth, close your lips and use your teeth to chew the food. Chew thoroughly, breaking it down into smaller pieces, and allow your saliva to mix with the food for easier swallowing. Once the food is adequately chewed, swallow it by using your tongue to propel it toward the back of your mouth and down your throat.\n\nRepeat: Continue the process of selecting, chewing, and swallowing bites of food until you have consumed a sufficient amount or until you are satisfied. Take your time, savor the flavors, and maintain a pace that is comfortable for you.",
  "fall floor": "Loss of Balance: Begin by experiencing a loss of balance or stability, which can be caused by various factors such as tripping, slipping, or a sudden force acting upon you. Your body starts to move out of its upright position, and you begin to descend towards the floor.\n\nDescending Motion: As you lose balance, your body starts to descend towards the floor. Your limbs may flail or reach out instinctively to try to regain stability or protect yourself from impact. The speed and trajectory of your fall will depend on the specific circumstances and the force involved.\n\nImpact and Landing: Eventually, you make contact with the floor. The impact can vary in intensity depending on factors such as the height of the fall, the surface you land on, and your body's position during the fall. It's essential to try to protect your head and vital areas during the fall to minimize the risk of injury.",
  "fencing": "Ready Position: Begin by assuming the ready position, also known as the en garde position. Stand with your feet shoulder-width apart, one foot slightly in front of the other. Bend your knees and keep your body relaxed. Hold the weapon (such as a foil, epee, or saber) with both hands, one hand gripping the handle and the other hand positioned slightly behind for balance.\n\nOffensive and Defensive Actions: Engage in offensive and defensive actions based on your strategy and the actions of your opponent. Use quick footwork to advance or retreat, maintaining balance and control. Execute attacks by extending your arm and aiming to strike your opponent's valid target area while avoiding being hit. Employ defensive techniques such as parries, which involve using your weapon to block or redirect your opponent's attack.\n\nScoring and Resets: Points are awarded based on valid hits made on your opponent's target area, following the specific rules of the fencing discipline you are practicing. After a valid hit or the end of a sequence, both fencers reset to the en garde position and prepare for the next exchange. Fencing bouts typically consist of multiple rounds or a predetermined number of points, with breaks in between for rest and assessment.",
  "flic flac": "Start Position: Begin by standing with your feet shoulder-width apart, knees slightly bent, and arms relaxed by your sides. Prepare for the flic flac by engaging your core muscles and focusing on maintaining balance and control.\n\nLeap and Backward Rotation: From the start position, leap upwards and slightly backwards, initiating the rotation. Swing your arms upward and simultaneously lean your body backward. As your body starts to rotate, tuck your knees towards your chest to increase the rotational momentum. Keep your eyes focused on the ground to maintain spatial awareness.\n\nLanding and Recovery: As you complete the rotation, extend your arms forward and prepare for landing. Aim to land on both feet simultaneously, absorbing the impact by bending your knees and rolling through the balls of your feet. Maintain balance and control as you transition from the landing position to a standing position, ready for the next movement or sequence.",
  "golf": "Address the Ball: Begin by taking your stance near the golf ball. Position your feet shoulder-width apart, with your knees slightly flexed. Align your body with the target, ensuring that your shoulders, hips, and feet are parallel to the target line. Grip the golf club with both hands, placing your leading hand (left hand for right-handed players) at the top of the grip and your trailing hand below it.\n\nSwing the Club: Initiate the swing by turning your shoulders and torso away from the target while keeping your arms extended and your eyes focused on the ball. As you reach the top of the backswing, shift your weight onto your back foot and begin the downswing by rotating your hips and initiating a controlled, fluid motion with your arms and wrists. Aim to strike the ball with the clubface, making contact with the ball before the ground.\n\nFollow Through: As you make contact with the ball, continue the motion by allowing the club to follow through. Extend your arms fully and rotate your body towards the target, maintaining balance and stability. Keep your eyes on the ball until it is airborne, and observe the direction and trajectory of your shot. After the shot, assess the result and prepare for the next shot based on the current position of the ball.",
  "handstand": "Starting Position: Begin by positioning yourself in a clear space with your feet hip-width apart. Bend down and place your hands on the ground, shoulder-width apart, fingers spread wide for stability. Position your hands slightly in front of your shoulders. Engage your core muscles and maintain a strong and stable body posture.\n\nKicking Up: From the starting position, shift your weight onto your hands and kick your legs up towards the air. Start by lifting one leg off the ground and use the other leg to generate momentum. As you kick up, engage your core muscles and maintain control throughout the movement. Aim to keep your body straight and aligned.\n\nBalance and Control: Once your legs are fully extended and you are upside down in a handstand position, focus on maintaining balance and control. Keep your arms straight and your shoulders active. Engage your core muscles to stabilize your body. Focus on a fixed point on the ground to help with balance. Take slow, controlled breaths to aid in stability.",
  "hit": "Prepare: Begin by positioning yourself in a stable and balanced stance, with your feet shoulder-width apart and your knees slightly flexed. Grip the object or implement you will use to hit, such as a bat, racket, or hand. Position your body and the implement in a way that allows for optimal control and power generation.\n\nGenerate Force: Initiate the hitting motion by rotating your body and transferring your weight onto your front foot (or the foot opposite to your dominant hand, if applicable). Engage your core muscles and use a combination of arm, wrist, and body movements to generate force. This could involve swinging the implement, extending your arm, or employing a specific technique depending on the sport or context.\n\nFollow Through: After making contact with the target or object, continue the motion by allowing your body and the implement to follow through. Maintain control and balance as you complete the swing or hit. The follow-through phase is essential for optimizing power, accuracy, and control. Pay attention to the trajectory and direction of the hit, and be prepared to adjust your stance or position for subsequent actions.",
  "hug": "Approach: Begin by moving closer to the person you want to hug. Open your arms and extend them towards the person, creating an inviting gesture. Maintain a relaxed and gentle posture, ensuring that your body language conveys warmth and openness.\n\nEmbrace: As you come into contact with the other person, wrap your arms around them in a gentle and supportive manner. Aim to make contact with their upper back or shoulders, depending on your comfort level and the nature of your relationship. Adjust the tightness of the hug based on the preferences of both individuals involved.\n\nHold and Release: Once you have embraced the person, maintain the hug for a brief moment, allowing both individuals to experience the connection and comfort. This duration can vary depending on the situation and the level of familiarity between the individuals. After the appropriate time, gently release the hug by loosening your arms and stepping back, respecting personal boundaries and comfort levels.",
  "jump": "Preparation: Begin by bending your knees and lowering your body into a crouched position. Keep your feet shoulder-width apart and your arms relaxed by your sides or slightly extended for balance. Engage your leg muscles, particularly your quadriceps and calf muscles, to prepare for the upward movement.\n\nPropel: From the crouched position, push off forcefully with your legs to generate upward momentum. Extend your legs and straighten your body as you rise into the air. Simultaneously swing your arms upward to provide additional momentum. Keep your core muscles engaged to help stabilize your body during the jump.\n\nLanding: As you reach the peak of your jump, prepare for landing by flexing your knees and hips to absorb the impact. Aim to land softly and quietly on the balls of your feet, rolling through the foot to distribute the force. Maintain balance and control as you return to a standing position, ready for the next movement or action.",
  "kick": "Stance and Preparation: Begin by assuming a stable and balanced stance. Position your feet shoulder-width apart, with your knees slightly bent. Determine which leg you will use to kick (your dominant leg is typically stronger). Lift your kicking leg, bending at the knee, while keeping your balance on your supporting leg. Keep your hands up for stability and protection.\n\nExecution: Initiate the kick by extending your kicking leg forward, aiming to make contact with the target. Generate power from your hip and core muscles, driving the leg forward with force. Depending on the type of kick, you may strike with the top of your foot, the ball of your foot, or your heel. Maintain good form and technique, keeping your eyes on the target and maintaining balance throughout the motion.\n\nRecovery: After executing the kick, swiftly bring your kicking leg back to the starting position, regaining balance and stability. Return to your initial stance, ready to defend or perform subsequent movements. It's important to maintain control and avoid overextending or losing balance during the recovery phase.",
  "kick ball": "Approach and Plant Foot: Begin by positioning yourself near the ball. Take a few steps towards the ball to generate momentum. As you approach the ball, plant your non-kicking foot beside the ball, slightly to the side and just a few inches away. This foot will provide stability and balance during the kick.\n\nSwing and Contact: As you plant your foot, swing your kicking leg backward, simultaneously shifting your weight onto your non-kicking foot. Swing your leg forward, aiming to make contact with the ball using the top of your foot, around the laces area. Keep your leg slightly bent to generate power. Make sure to maintain eye contact with the ball throughout the motion to ensure accuracy.\n\nFollow Through: After making contact with the ball, continue the motion by allowing your kicking leg to follow through. Extend your leg forward and upwards, maintaining balance and control. The follow-through phase helps provide power and accuracy to your kick. Keep your body balanced and ready for the next movement or action.",
  "kiss": "Approach and Close the Distance: Begin by moving closer to the person you want to kiss. Maintain eye contact and gauge the mutual interest and consent for the kiss. As you get closer, tilt your head slightly to one side to avoid any potential collision of noses. Gradually decrease the distance between your faces, ensuring a comfortable and intimate proximity.\n\nLip Contact: Once you are close enough, gently touch your lips to your partner's lips. Begin with a soft and light pressure. You can start with a closed-mouth kiss, where your lips come into contact without parting. Alternatively, you can explore a gentle opening of the lips, known as a \"peck\" or a \"parted-lips kiss.\" Pay attention to your partner's responses and adjust the intensity and style of the kiss accordingly.\n\nSensual Exploration and Release: Once the initial contact is established, you can explore different sensations and intensify the kiss if both partners are comfortable and willing. This may involve deepening the kiss by softly moving your lips against your partner's, gently using your tongue, or incorporating other sensual elements. Remember to communicate with your partner through non-verbal cues and be responsive to their cues as well. After the kiss, gradually release the lip contact and maintain eye contact or engage in other affectionate gestures.",
  "laugh": "Trigger and Response: Something funny or amusing triggers the laughter response. It could be a joke, a humorous situation, or something unexpected. Laughter often begins with a sense of surprise or amusement that prompts a physical and emotional reaction.\n\nExpression: Once the laughter response is triggered, it manifests through a series of physical and vocal expressions. These expressions may include opening the mouth, producing vocal sounds, and shaking or convulsing the body. Laughter is often accompanied by a release of tension and an outward display of amusement or joy.\n\nDuration and Recovery: The duration of laughter can vary, ranging from a brief chuckle to a prolonged belly laugh. After the initial expression of laughter, there is typically a gradual recovery as the amusement subsides. Breathing normalizes, the body relaxes, and the laughter gradually fades away.",
  "pick": "Identify and Position: First, identify the object you want to pick up. Assess its size, weight, and any potential hazards. Position yourself close to the object, ensuring that you have a clear and safe path to reach it. Bend your knees slightly to prepare for the picking motion.\n\nReach and Grip: Extend your arms towards the object, maintaining a firm and controlled grip. Depending on the size and weight of the object, you may use one hand or both hands to grasp it. Use your fingers and palms to secure a secure grip, ensuring that you have a solid hold on the object and can maintain control throughout the picking process.\n\nLift and Carry: Engage your leg muscles and core as you lift the object off the surface. Use a smooth and controlled motion to avoid straining your back or other muscles. Once the object is lifted, adjust your stance and posture as needed to ensure stability and balance. Carry the object close to your body, distributing the weight evenly, and walk or move to the desired location while maintaining control.",
  "pour": "Position and Tilt: Begin by positioning the container you are pouring from above the target container or surface. Hold the pouring container steadily with one hand while using the other hand to stabilize the target container if necessary. Tilt the pouring container slowly and steadily to initiate the flow of the liquid.\n\nControl and Direct: As the liquid begins to flow, maintain control over the speed and direction of the pour. Adjust the angle of the pouring container to control the flow rate. Slow down or tilt the container back slightly to reduce the flow, or tilt it further to increase the flow. Direct the stream of liquid to the desired location within the target container, taking care to avoid spills or splashing.\n\nComplete and Stabilize: Once the desired amount of liquid has been poured, gradually bring the pouring container back to an upright position to stop the flow. Allow any remaining liquid in the container to drip or settle before placing it down. Stabilize the target container if necessary and ensure that both containers are placed securely on a stable surface to prevent accidental spills or tipping.",
  "pullup": "Grip and Hang: Begin by gripping an overhead bar with both hands. Your palms can face either towards you (underhand grip) or away from you (overhand grip), depending on your preference and comfort. Hang from the bar with your arms fully extended, and your body relaxed, maintaining a stable and controlled position.\n\nPull and Ascend: Engage your upper body muscles, particularly your back, shoulders, and arms, to initiate the pull-up. Begin by squeezing your shoulder blades together and pulling your body upward towards the bar. Focus on using your upper body strength to lift your chin above the bar. Keep your core muscles engaged to maintain stability and control throughout the movement.\n\nLower and Repeat: Once you have reached the top position with your chin above the bar, slowly lower your body back down to the starting position with controlled movement. Extend your arms fully and relax your muscles before repeating the pull-up. Aim to perform the exercise in a smooth and controlled manner, maintaining proper form and avoiding swinging or using momentum to complete the movement.",
  "punch": "Stance and Preparation: Begin by assuming a balanced and stable stance. Position your feet shoulder-width apart, with one foot slightly ahead of the other (if you're right-handed, your left foot would be slightly ahead). Bend your knees slightly and keep your body relaxed but ready. Position your fists near your face, with your elbows close to your body for protection.\n\nExtension and Impact: To throw a punch, generate power from your lower body and core muscles. Rotate your hips and shoulders as you extend your punching arm forward. Aim to make contact with the target using the first two knuckles of your hand (if you're right-handed, it would be the knuckles of your index and middle fingers). Keep your wrist straight and aligned with your forearm to avoid injury. Strike the target with force and accuracy, focusing on speed and technique.\n\nRecoil and Guard: After making contact with the target, quickly retract your punching arm back to the starting position. Maintain good form and guard your face by bringing your punching hand back near your face, close to your chin or cheek. Keep your other hand up for additional protection. Stay alert and prepared for any counterattacks or further actions, maintaining a balanced stance and readiness to defend or perform subsequent movements.",
  "push": "Position and Stance: Begin by positioning yourself in front of the object or person you want to push. Place your feet shoulder-width apart, with one foot slightly ahead of the other to maintain balance and stability. Bend your knees slightly and engage your core muscles to provide a solid foundation for the push.\n\nPush and Engage: Extend your arms forward, keeping them slightly bent at the elbows. Shift your body weight onto your front foot as you push with your arms and upper body. Use your chest, shoulders, and core muscles to generate force as you press against the object or person. Aim to exert steady and controlled pressure, maintaining a strong and stable position.\n\nFollow Through and Release: Continue pushing until you achieve the desired effect or movement. Once you've applied sufficient force, gradually release the pressure and bring your body back to a neutral position. Maintain awareness of your surroundings and any potential hazards during the push. If necessary, reposition yourself and adjust your stance to prepare for any subsequent actions or movements.",
  "pushup": "Starting Position: Begin by assuming a prone position on the floor or exercise mat. Place your hands slightly wider than shoulder-width apart, with your palms flat on the ground and fingers pointing forward. Extend your legs fully, keeping your toes in contact with the ground. Engage your core muscles to maintain a straight line from your head to your heels.\n\nLowering Phase: Start the push-up by bending your elbows and lowering your chest towards the ground. Keep your body straight and avoid sagging or arching your back. As you descend, maintain control and aim to bring your chest as close to the ground as possible without touching it. Keep your elbows at a 45-degree angle to your body.\n\nPushing Phase: Once you've reached the lowest position, push through your palms and extend your arms to raise your body back up. Focus on using your chest, shoulders, and triceps to generate the force needed to lift your body. Keep your core engaged and maintain a straight line from your head to your heels throughout the movement. Fully extend your arms at the top of the movement, without locking your elbows, and repeat the process for the desired number of repetitions.",
  "ride bike": "Mounting and Balance: Begin by positioning yourself next to the bike and ensuring it is stable. Swing one leg over the bike frame, straddling the saddle. Place both feet on the ground and grip the handlebars firmly. Push off with one foot, using it to propel yourself forward while simultaneously lifting your other foot off the ground. Find your balance by keeping the bike upright and centered.\n\nPedaling and Steering: Once you are balanced and moving, place your feet on the pedals. Push down with one foot while simultaneously lifting the other foot to bring the pedals up. Continue this alternating motion to propel the bike forward. Use the handlebars to steer by gently turning them in the desired direction. Keep your body relaxed and upright, using your core muscles to maintain stability.\n\nBraking and Dismounting: When you need to slow down or stop, squeeze the brake levers located on the handlebars. Apply gradual pressure to both brakes to slow down smoothly. If you need to come to a complete stop, apply more pressure to bring the bike to a halt. When you are ready to dismount, slow down and choose a safe spot to stop. Place one foot on the ground while still straddling the saddle, and then swing your other leg over to dismount from the bike.",
  "ride horse": "Mounting: Approach the horse from the left side, also known as the near side. Hold the reins in your left hand and use your right hand to support yourself. Place your left foot in the stirrup, which is the loop attached to the saddle on the left side. With your left foot in the stirrup, push yourself up and swing your right leg over the horse's back, settling into the saddle. Keep a firm grip on the reins and ensure your feet are securely in the stirrups.\n\nRiding: Once you are in the saddle, sit upright with a straight back and relaxed posture. Hold the reins with both hands, maintaining a light and steady contact. Use your legs and body to communicate with the horse. Apply gentle pressure with your legs to encourage the horse to move forward. To steer, use the reins to guide the horse's head in the desired direction. Maintain balance and stability by keeping your weight centered and following the horse's movements.\n\nDismounting: When you are ready to dismount, bring the horse to a stop. Relax your legs and shift your weight slightly to the left side of the saddle. Remove your right foot from the stirrup and swing your right leg over the horse's back, carefully lowering yourself to the ground. Land softly on both feet, maintaining control and balance. Once you are safely on the ground, lead the horse or secure it as necessary.",
  "run": "Starting Position: Begin by standing upright with your feet hip-width apart. Keep your body relaxed but ready for movement. Bend your elbows at approximately a 90-degree angle, with your arms close to your sides. Maintain a slight forward lean from your ankles, and keep your gaze focused ahead.\n\nStride and Pace: Push off with one foot as you take a forward step. As your foot lands on the ground, roll through your foot from heel to toe, propelling yourself forward. Swing your opposite arm forward in sync with the leg that is stepping. Maintain a steady rhythm and pace, allowing your arms and legs to move naturally and efficiently. Keep your strides comfortable and avoid overstriding or excessive bouncing.\n\nBreathing and Endurance: Breathe deeply and rhythmically as you run, inhaling through your nose and exhaling through your mouth. Find a breathing pattern that works for you, such as inhaling for a certain number of steps and exhaling for the same number. Focus on maintaining a consistent breath and staying relaxed throughout your run. Build endurance gradually by increasing your running distance or time at a pace that challenges you but remains sustainable.",
  "shake hands": "Approach and Extend: Begin by approaching the person with whom you wish to shake hands. Maintain eye contact and offer a friendly smile. As you get closer, extend your right hand toward the other person. Keep your fingers together and your thumb relaxed alongside your hand.\n\nGrip and Shake: As your hands meet, firmly but gently grasp the other person's hand. Align your palm with theirs and interlock your fingers. Apply even pressure, neither too weak nor too strong, as you shake hands. Engage in a brief up-and-down motion, moving your hands together for a few gentle shakes. Maintain a confident and friendly demeanor throughout the handshake.\n\nRelease and Gesture: After a few shakes, release your grip. Simultaneously, withdraw your hand in a smooth and natural motion, while maintaining eye contact and possibly offering a verbal greeting or exchange. Consider other cultural gestures or formalities that may accompany the handshake, such as nodding or exchanging pleasantries. Be attentive to any cues or signals from the other person regarding the appropriate duration of the handshake.",
  "shoot ball": "Positioning and Preparation: Begin by positioning yourself near the basketball hoop. Stand with your feet shoulder-width apart, facing the hoop. Bend your knees slightly and hold the ball with both hands, fingers spread evenly on the ball's surface. Position the ball in front of your dominant hand, with your other hand supporting the side of the ball. Align your dominant eye with the target, which is the hoop.\n\nShooting Motion: As you prepare to shoot, use your legs and core muscles to generate power. Begin the shooting motion by extending your legs, pushing off the ground and propelling your body upward. Simultaneously, bring the ball up toward your dominant hand, using your non-dominant hand as a guide. As the ball reaches its peak, release it with a smooth and controlled motion, using your fingertips to impart backspin on the ball. Your shooting hand should follow through naturally, with your arm extending upward and your wrist snapping slightly.\n\nFollow-through and Observation: After releasing the ball, maintain a consistent and fluid follow-through motion. Your shooting arm should remain extended, with your wrist flexed and your fingers pointing toward the hoop. Keep your eyes on the ball as it travels toward the hoop, observing its trajectory and adjusting your aim if necessary. Observe the result of the shot and be prepared to react accordingly, whether it's celebrating a successful shot or quickly transitioning to defense for a potential rebound.",
  "shoot bow": "Stance and Grip: Begin by assuming a proper shooting stance. Stand perpendicular to the target with your feet shoulder-width apart. Position your dominant side slightly behind the opposite side. Hold the bow with your non-dominant hand, extending your arm straight in front of you. Use your dominant hand to grip the bow handle, ensuring a relaxed and consistent grip. Maintain a firm but not overly tight hold on the bow.\n\nNocking and Drawing: Nocking refers to placing the arrow onto the bowstring. With your non-dominant hand, take an arrow and position the nock (the groove at the end of the arrow) securely onto the bowstring. Use your fingertips to hold the arrow in place. Next, raise the bow upward, keeping your arm extended. Use your dominant hand to draw the bowstring back toward your face. Maintain a smooth and controlled motion as you draw, ensuring the bowstring is centered and aligned with your dominant eye.\n\nAiming and Release: Once the bowstring is fully drawn, anchor the string against a predetermined point on your face, such as the corner of your mouth or the side of your chin. Align your dominant eye with the target, focusing your gaze on a specific spot. Take a moment to aim and steady your position. When you are ready, release the bowstring by relaxing your fingers and allowing the string to slip away from your fingertips. Maintain a consistent follow-through, keeping your bow arm extended and your body stable.",
  "shoot gun": "Load the Gun: Begin by ensuring that the gun is not loaded or activated. In most cases, you may need to open or access a compartment that holds the projectiles or ammunition. Insert the projectiles or ammunition into the designated area as instructed by the gun's design. Ensure they are securely in place.\n\nAim the Gun: With the gun loaded, take a comfortable and stable stance. Extend your arm and align the gun with your intended target. Keep your grip firm but not excessively tight, ensuring you have control over the gun. Focus your eyes on the target and aim the gun accordingly. Take your time to adjust your aim and align the gun precisely.\n\nFire the Gun: Once you have aimed the gun, activate the firing mechanism as directed by the gun's design. This may involve pulling a trigger, pressing a button, or utilizing a specific mechanism unique to the gun. When you are ready to shoot, activate the mechanism and release the projectiles or ammunition toward the target.",
  "sit": "Approach the Seat: Identify a suitable seat or chair to sit on. Move towards the seat and position yourself in front of it, facing the seat. Ensure that the seat is stable and secure.\n\nLower Your Body: Bend your knees and initiate the lowering motion by shifting your weight towards the seat. As you lower your body, aim to keep your back straight and maintain a controlled descent. Extend your arms slightly forward or to the sides to help maintain balance if needed.\n\nMake Contact and Adjust: When your legs are positioned to reach the seat, lower your body fully onto the seat's surface. Ensure that your buttocks are centered and make contact with the seat. Adjust your position as necessary to find a comfortable and balanced sitting position. Straighten your legs and relax your arms as appropriate for the specific seat and your comfort.",
  "situp": "Starting Position: Begin by lying flat on your back on a comfortable surface, such as a mat or a carpeted floor. Bend your knees and place your feet flat on the ground, hip-width apart. Position your arms alongside your body, with your palms facing down. Relax your neck and shoulders.\n\nEngage Your Core: Engage your abdominal muscles by drawing your navel towards your spine. This action helps to stabilize your core and protect your lower back. Keeping your feet grounded, slowly lift your upper body off the ground, curling forward. As you rise, aim to bring your chest closer to your thighs by flexing your abdominal muscles. Avoid straining your neck and keep your gaze focused straight ahead or towards your knees.\n\nReturn to Starting Position: Once your upper body is fully lifted, slowly lower yourself back down to the starting position in a controlled manner. Lower your back and shoulders to the ground, one vertebra at a time. Keep your core engaged throughout the movement. As you descend, avoid abruptly flopping back down and maintain a smooth, controlled motion.",
  "smile": "Facial Muscles: Begin by relaxing your facial muscles. Let go of any tension or frowns you may be holding. Release your jaw by slightly parting your lips.\n\nLift the Corners: Slowly lift the corners of your mouth upward. Allow your lips to form a gentle curve. As you do so, engage the muscles around your mouth and cheeks to create a natural and comfortable smile. It's okay if your teeth are not showing; focus on the upward movement of the corners of your mouth.\n\nSparkle in the Eyes: To enhance your smile, let your eyes reflect the joy or happiness within you. Allow your eyes to soften and convey a sense of warmth. You can achieve this by imagining a pleasant or positive thought, or by thinking of something that brings you happiness. Let that emotion radiate through your eyes, adding a genuine and authentic sparkle to your smile.",
  "smoke": "Hand Position: Begin by forming a loosely clbosed fist with your dominant hand. Position your thumb against the side of your index finger, leaving a small gap between them. This will create a space where you can simulate holding a cigarette.\n\nInhalation Gesture: Bring your dominant hand, with the simulated cigarette, to your mouth. Use your non-dominant hand to create an open-palm gesture near your mouth, mimicking the act of inhaling. As you bring your dominant hand to your mouth, take a gentle inhalation to draw in smoke.\n\nExhalation Gesture: After the inhalation, slowly exhale through your mouth to release the smoke. You can create a puffing motion with your lips or blow a gentle stream of air to exhale smoke.",
  "somersault": "Preparation: Begin by positioning yourself in a safe and clear area, preferably on a soft surface such as a mat or grass. Stand with your feet shoulder-width apart and bend your knees slightly to prepare for the somersault. Lower yourself into a crouched position, bringing your arms in front of you and tucking your chin toward your chest.\n\nRolling Motion: From the crouched position, propel yourself forward by pushing off with your feet and tucking your body into a tight ball. As you leave the ground, bend forward and tuck your head toward your knees, allowing your body to roll forward. Use the momentum generated from your push to initiate the rolling motion.\n\nLanding and Extension: As your body completes the roll, extend your legs and gradually uncurl your body, allowing your feet to come back in contact with the ground. Extend your arms outward for balance and stability. Ensure that you maintain control of your body and land on your feet with a stable stance.",
  "stand": "Prepare: Begin by sitting or being in a position where you can transition to standing. If you are sitting, shift your weight forward and position your feet flat on the ground, hip-width apart. If you are already in a position where you can transition to standing, ensure you have a stable base and your feet are properly positioned.\n\nPush and Rise: Engage your leg muscles and use your arms, if needed, to push off from the surface you were sitting or resting on. Apply upward force through your legs to lift your body in a controlled manner. Maintain a straight back and engage your core muscles for stability.\n\nStabilize: As you reach a standing position, ensure you have a stable and balanced stance. Place your feet firmly on the ground, hip-width apart, and distribute your weight evenly between both feet. Straighten your posture, relax your shoulders, and maintain a natural alignment of your head, spine, and hips.",
  "swing baseball": "Stance and Grip: Begin by positioning yourself in the batter's box with your feet shoulder-width apart. Hold the baseball bat with both hands, gripping it firmly but not overly tight. Your dominant hand should be closer to the barrel end of the bat, while your non-dominant hand should be closer to the handle. Find a comfortable grip that allows you to control the bat.\n\nLoad and Rotation: As the pitcher delivers the ball, prepare to swing by loading your body weight onto your back foot. This involves shifting your weight onto your back leg while slightly bending your knees. As the pitch approaches, initiate your swing by rotating your hips and torso in the direction of the pitch. Simultaneously, bring the bat back, keeping it level and parallel to the ground.\n\nSwing and Follow-through: As the pitch reaches the strike zone, unleash your swing by driving your hips and rotating your torso forcefully. Extend your arms and bring the bat through the hitting zone, making contact with the ball. Aim to make solid contact with the ball using the sweet spot of the bat, which is typically near the barrel. After making contact, continue your swing with a smooth follow-through, allowing the bat to naturally carry through the swing, high and over your shoulder.",
  "sword": "Grip: Begin by holding the sword with both hands. Your dominant hand should grip the handle closer to the guard, while your non-dominant hand holds the handle closer to the pommel. Ensure that your grip is firm but not overly tight, allowing for flexibility and control.\n\nStance and Position: Assume a balanced and stable stance, with your feet shoulder-width apart. Position yourself in a way that allows you to maneuver and strike effectively. Hold the sword in front of you, keeping it aligned with your body and parallel to the ground. Maintain a relaxed and ready posture, with your elbows slightly bent.\n\nStriking and Defending: Use the sword to execute strikes and defend yourself as needed. When striking, aim to generate power and accuracy by utilizing your body's rotation and transferring your weight into the strike. Practice a variety of strikes, such as slashes and thrusts, while maintaining control and balance. When defending, use the sword to block or parry incoming attacks, keeping your body protected and minimizing the risk of injury.",
  "sword exercise": "Stance and Grip: Begin by assuming a balanced and stable stance with your feet shoulder-width apart. Hold the sword with both hands, maintaining a firm but not overly tight grip. Your dominant hand should be closer to the guard, while your non-dominant hand supports the bottom of the handle. Keep your elbows slightly bent, allowing for flexibility and control.\n\nStrikes and Movements: Practice a series of sword strikes and movements. Execute controlled strikes, such as diagonal slashes, horizontal cuts, or thrusts, while focusing on proper form and technique. Engage your core muscles and use your body's rotation and weight transfer to generate power in each strike. Combine your strikes with footwork, incorporating steps forward, backward, or sideways to simulate various attack and defense scenarios.\n\nTiming and Flow: As you become more comfortable with the strikes and movements, work on timing and flow. Aim for smooth transitions between strikes, ensuring that your movements are fluid and connected. Maintain a sense of rhythm and control as you perform the exercise, focusing on maintaining balance and coordination throughout.",
  "talk": "Formation of Words: Initiate the action of talking by forming words in your mind. This involves mentally selecting the thoughts or ideas you wish to express and converting them into verbalized language. Your brain processes the information and prepares to communicate it through speech.\n\nVocalization: Once you have formed the words in your mind, engage your vocal cords and articulate the sounds that correspond to the words. This involves using your mouth, tongue, and vocal apparatus to produce the specific speech sounds necessary to convey your message. Control the airflow and shape of your mouth to create the desired sounds.\n\nCommunication: As you vocalize the words, they are projected into the surrounding environment. Your message is transmitted to others who can hear you, allowing for communication and exchange of information. This step involves the reception of your spoken words by others, who interpret and understand your message based on the sounds they hear.",
  "throw": "Preparation: Begin by positioning yourself in a stable and balanced stance. If you're throwing an object, hold it securely in your hand. Align your body and aim in the direction you want to throw. Visualize the trajectory and target of your throw.\n\nWind-up and Release: As you prepare to throw, initiate a wind-up motion by moving your throwing arm backward. Simultaneously, shift your weight onto your back foot. This wind-up motion helps generate power for the throw. Then, swiftly transfer your weight forward, rotate your hips and torso, and extend your throwing arm forward. Release the object from your hand at the appropriate moment, propelling it towards the target with a smooth and controlled motion.\n\nFollow-through: After releasing the object, continue the throwing motion with a follow-through. Allow your arm to continue its natural path, extending forward and then swinging downward and across your body. This follow-through motion helps maintain balance and control after the throw.",
  "turn": "Preparation: Begin by adjusting your stance to prepare for the turn. Plant your feet firmly on the ground, shoulder-width apart, with your weight evenly distributed. Determine the direction in which you want to turn. Visualize the path and angle of the turn you intend to make.\n\nInitiate the Turn: To initiate the turn, shift your weight slightly in the direction you want to turn. This weight shift helps create momentum for the turn. Simultaneously, pivot on the ball of your foot that corresponds to the direction of the turn. For example, if you're turning to the right, pivot on the ball of your right foot. Use your arms to assist in the turning motion, allowing them to naturally swing in the direction of the turn.\n\nComplete the Turn: As you pivot on the ball of your foot, allow your body to rotate in the desired direction. Maintain your balance and stability throughout the turn. Once you have completed the desired degree of rotation, bring your other foot to join the pivot foot, aligning your feet with the new direction you are facing. Keep your body relaxed and maintain a smooth and controlled motion during the turn.",
  "walk": "Stance and Posture: Begin by standing upright with your feet shoulder-width apart. Maintain a relaxed and balanced posture, keeping your head up and your shoulders relaxed. Your arms can naturally swing by your sides.\n\nForward Movement: To initiate walking, shift your body weight onto one foot and take a step forward with the opposite foot. As you take a step, roll your foot from heel to toe, transferring your weight onto the stepping foot. Swing your opposite arm forward in coordination with the leg movement. Maintain a comfortable and natural stride length, neither too short nor too long.\n\nRepeat Steps: After taking a step with one foot, transfer your weight to that foot and bring the other foot forward to take the next step. Continue this alternating motion, coordinating the movement of your arms and legs. Maintain a steady rhythm and pace as you walk. Keep your upper body stable and aligned with your legs, ensuring a smooth and efficient walking motion.",
  "wave": "Raise Arm: Begin by raising your arm from a resting position. Lift your hand and forearm upward, extending it away from your body. Keep your elbow slightly bent to maintain a relaxed posture.\n\nSide-to-Side Motion: Move your hand and forearm in a side-to-side motion. Start by moving your hand in one direction, such as from left to right or right to left. Keep the movement smooth and fluid, creating a waving motion. You can choose how wide or narrow the wave is depending on your preference.\n\nRepeat and Adjust: Repeat the side-to-side motion of your hand and forearm to sustain the wave. You can adjust the speed and amplitude of the wave to convey different meanings or greetings. For example, a slower and more deliberate wave may indicate a greeting or a farewell, while a faster wave may express enthusiasm or urgency."
}
