{
  "Pouring [something] into [something]":"A person is transferring a liquid or flowable substance from one container into another.",
  "Poking a stack of [something] without the stack collapsing": "A person is carefully applying pressure to a stack of objects while maintaining its stability.",
  "Pretending to poke [something]": "A person is mimicking the action of poking an object without actually making contact.",
  "Lifting up one end of [something] without letting it drop down": "A person is raising one side of an object and holding it in an elevated position.",
  "Moving [part] of [something]": "A person is repositioning a specific component or section of an object.",
  "Moving [something] and [something] away from each other": "A person is increasing the distance between two separate objects by relocating them in opposite directions.",
  "Removing [something], revealing [something] behind": "A person is taking away an object to expose another object that was hidden behind it.",
  "Plugging [something] into [something]": "A person is inserting one object into another, typically to make an electrical or physical connection.",
  "Tipping [something] with [something in it] over, so [something in it] falls out": "A person is tilting a container to cause its contents to spill out.",
  "Stacking [number of] [something]": "A person is placing multiple objects on top of each other to form a pile.",
  "Putting [something] onto a slanted surface but it doesn't glide down": "A person is placing an object on an incline where it remains stationary despite the slope.",
  "Moving [something] across a surface until it falls down": "A person is pushing or sliding an object along a surface until it reaches the edge and drops.",
  "Throwing [something] in the air and catching it": "A person is tossing an object upward and then grabbing it as it falls back down.",
  "Putting [something that cannot actually stand upright] upright on the table, so it falls on its side": "A person is attempting to balance an unstable object vertically, causing it to topple over.",
  "Holding [something] next to [something]": "A person is positioning one object in close proximity to another without them touching.",
  "Pretending to put [something] underneath [something]": "A person is mimicking the action of placing an object beneath another without actually doing so.",
  "Poking [something] so lightly that it doesn't or almost doesn't move": "A person is gently touching an object with minimal force, resulting in little to no movement.",
  "Approaching [something] with your camera": "A person is moving a camera closer to an object to capture a more detailed view.",
  "Poking [something] so that it spins around": "A person is applying force to an object to cause it to rotate on its axis.",
  "Pushing [something] so that it falls off the table": "A person is applying force to an object, causing it to move off the edge of a surface and drop.",
  "Spilling [something] next to [something]": "A person is causing a substance to pour or fall out near another object.",
  "Pretending or trying and failing to twist [something]": "A person is mimicking or unsuccessfully attempting to rotate an object around its axis.",
  "Pulling two ends of [something] so that it separates into two pieces": "A person is applying force to both ends of an object to cause it to break or split.",
  "Lifting up one end of [something], then letting it drop down": "A person is raising one side of an object and then releasing it to fall back into place.",
  "Tilting [something] with [something] on it slightly so it doesn't fall down": "A person is carefully angling an object with another object on top, maintaining balance to prevent items from falling.",
  "Spreading [something] onto [something]": "A person is applying a substance across the surface of another object.",
  "Touching (without moving) [part] of [something]": "A person is making physical contact with a specific area of an object without displacing it.",
  "Turning the camera left while filming [something]": "A person is rotating the camera horizontally to the left while recording an object.",
  "Pushing [something] so that it slightly moves": "A person is applying gentle force to an object, causing it to shift position minimally.",
  "Uncovering [something]": "A person is removing a covering or lid to expose an object underneath.",
  "Moving [something] across a surface without it falling down": "A person is sliding or pushing an object along a flat area while maintaining its balance.",
  "Putting [something] behind [something]": "A person is placing one object in a position where it is obscured by another object.",
  "Attaching [something] to [something]": "A person is connecting or fastening one object to another.",
  "Pulling [something] onto [something]": "A person is dragging or lifting an object to position it on top of another object.",
  "Burying [something] in [something]": "A person is hiding an object by covering it completely with another substance or material.",
  "Putting [number of] [something] onto [something]": "A person is placing a specific quantity of objects on top of another object.",
  "Letting [something] roll along a flat surface": "A person is allowing a round or cylindrical object to move across a level area by its own momentum.",
  "Bending [something] until it breaks": "A person is applying force to flex an object to the point where it snaps or separates.",
  "Showing [something] behind [something]": "A person is revealing an object that is positioned behind another object.",
  "Pretending to open [something] without actually opening it": "A person is mimicking the action of opening an object without actually doing so.",
  "Pretending to put [something] onto [something]": "A person is mimicking the action of placing one object on top of another without actually doing it.",
  "Moving away from [something] with your camera": "A person is increasing the distance between a camera and an object while filming.",
  "Wiping [something] off of [something]": "A person is cleaning or removing a substance from the surface of an object.",
  "Pretending to spread air onto [something]": "A person is mimicking the action of applying air to the surface of an object.",
  "Holding [something] over [something]": "A person is suspending one object above another without letting them touch.",
  "Pretending or failing to wipe [something] off of [something]": "A person is mimicking or unsuccessfully attempting to clean or remove a substance from an object.",
  "Pretending to put [something] on a surface": "A person is mimicking the action of placing an object on a flat area without actually doing so.",
  "Moving [something] and [something] so they collide with each other": "A person is causing two objects to come into contact with force.",
  "Pretending to turn [something] upside down": "A person is mimicking the action of flipping an object over without actually doing it.",
  "Showing [something] to the camera": "A person is presenting an object in view of a recording device.",
  "Dropping [something] onto [something]": "A person is releasing an object from a height so it falls onto another object.",
  "Pushing [something] so that it almost falls off but doesn't": "A person is applying force to move an object close to an edge without it actually falling.",
  "Piling [something] up": "A person is stacking multiple objects to create a heap or mound.",
  "Taking [one of many similar things on the table]": "A person is selecting and removing a single item from a group of alike objects on a surface.",
  "Putting [something] in front of [something]": "A person is placing one object in a position where it partially or fully obscures another object from view.",
  "Laying [something] on the table on its side, not upright": "A person is positioning an object horizontally on a flat surface rather than vertically.",
  "Lifting a surface with [something] on it until it starts sliding down": "A person is raising one end of a surface with an object on it until the object begins to move due to gravity.",
  "Poking [something] so it slightly moves": "A person is applying a small amount of force to an object, causing it to shift position minimally.",
  "Putting [something] into [something]": "A person is inserting or placing one object inside another object or container.",
  "Pulling [something] from right to left": "A person is moving an object horizontally from one side to another by applying force.",
  "Showing that [something] is empty": "A person is demonstrating that an object or container has nothing inside it.",
  "Spilling [something] behind [something]": "A person is causing a substance to pour or fall out in an area behind another object.",
  "Letting [something] roll down a slanted surface": "A person is allowing a round or cylindrical object to move down an incline due to gravity.",
  "Holding [something] behind [something]": "A person is positioning one object in a way that it is obscured by another object from the viewer's perspective.",
  "Twisting (wringing) [something] wet until water comes out": "A person is applying a rotating force to a damp object to extract liquid.",
  "Poking a hole into [something soft]": "A person is creating an opening in a pliable material by applying pointed pressure.",
  "Pretending to take [something] from [somewhere]": "A person is mimicking the action of retrieving an object from a location without actually doing so.",
  "Putting [something] upright on the table": "A person is positioning an object vertically on a flat surface.",
  "Poking a hole into [some substance]": "A person is creating an opening in a material by applying pointed pressure.",
  "Rolling [something] on a flat surface": "A person is causing an object to rotate along its axis across a level area.",
  "Poking a stack of [something] so the stack collapses": "A person is applying force to a pile of objects, causing it to lose its structure and fall.",
  "Twisting [something]": "A person is rotating an object around its axis.",
  "[Something] falling like a feather or paper": "A person is observing or causing an object to descend slowly through the air.",
  "Putting [something] on the edge of [something] so it is not supported and falls down": "A person is placing an object in an unstable position on the brink of another object, resulting in it dropping.",
  "Pushing [something] off of [something]": "A person is applying force to move an object from its resting place on another object, causing it to fall.",
  "Dropping [something] into [something]": "A person is releasing an object from a height so it falls into a container or another object.",
  "Letting [something] roll up a slanted surface, so it rolls back down": "A person is allowing an object to move up an incline and then descend due to gravity.",
  "Pushing [something] with [something]": "A person is using one object to apply force to move another object.",
  "Opening [something]": "A person is unfolding, unlocking, or creating an access point to an object or container.",
  "Putting [something] on a surface": "A person is placing an object on top of a flat area.",
  "Taking [something] out of [something]": "A person is removing an object from inside another object or container.",
  "Spinning [something] that quickly stops spinning": "A person is causing an object to rotate rapidly and then observing its swift deceleration.",
  "Unfolding [something]": "A person is opening or spreading out a folded object.",
  "Moving [something] towards the camera": "A person is bringing an object closer to the recording device.",
  "Putting [something] next to [something]": "A person is placing one object in close proximity to another object.",
  "Scooping [something] up with [something]": "A person is using one object to gather and lift another substance or material.",
  "Squeezing [something]": "A person is applying pressure to compress or extract something from an object.",
  "Failing to put [something] into [something] because [something] does not fit": "A person is unsuccessfully attempting to insert an object into another due to size incompatibility."
}
